УТ_для_edt/src/DataProcessors/CRM_ЗагрузкаДанныхИзФайла/CRM_ЗагрузкаДанныхИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_ЗагрузкаДанныхИзФайла</name>
</mdclass:DataProcessor>

УТ_для_edt/src/Enums/CRM_РазделыНастройкиРешения/CRM_РазделыНастройкиРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_РазделыНастройкиРешения</name>
  <enumValues>
    <name>ПочтовыйКлиент</name>
  </enumValues>
  <enumValues>
    <name>ПортретКлиента</name>
  </enumValues>
  <enumValues>
    <name>СценарииПродаж</name>
  </enumValues>
  <enumValues>
    <name>Телефония</name>
  </enumValues>
  <enumValues>
    <name>Диалоги</name>
  </enumValues>
  <enumValues>
    <name>Показатели</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_ПотенциальныеКлиенты/CRM_ПотенциальныеКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ПотенциальныеКлиенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Идентификатор в системе идентификации по лицу</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.CRM_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Отрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартОписаниеЭтапа</name>
    <comment>//++ #1656 смарт: Фролов 27.02.2023 //Создание механизма отображения необходимых действий менеджером, на каждом этапе обработки Интереса.</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаКвалификацию</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаСогласованиеКП</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаВыставлениеСчета</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартЧасовНаОплату</name>
    <comment>//++ #Б-1184 Фролов //Добавить реквизиты в справочник &quot;CRM_СостоянияИнтересов&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_ЗагрузкаДанныхИзФайла/Forms/ФормаИмпортаПотенциальныхКлиентов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги;
	РеквизитыЗаполняемыеПоУмолчанию.Добавить("Справочник.Партнеры.Родитель");
	РеквизитыЗаполняемыеПоУмолчанию.Добавить("Справочник.CRM_ПотенциальныеКлиенты.ОсновнойМенеджер");
	РеквизитыЗаполняемыеПоУмолчанию.Добавить("Документ.CRM_Интерес.Дата");
	РеквизитыЗаполняемыеПоУмолчанию.Добавить("Документ.CRM_Интерес.СостояниеИнтереса");
	ТипКИТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ТипКИEMail = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ИскатьПоНаименованию = Истина;
	Разделитель = ";";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.Родитель = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияИнтересов.ПустаяСсылка)
	                      |	И НЕ CRM_СостоянияИнтересов.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.Количество() = 1 Тогда
		СценарийПродаж = Выборка.Ссылка;
	КонецЕсли;
	Элементы.ТипУслуги.Видимость = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТипыУслуг");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПродолжение", ЭтотОбъект, Отказ);
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(ОписаниеОповещения,,
		НСтр("ru='В Веб-клиенте без установленного расширения работы с файлами добавление файлов не поддерживается.';en='The adding files is not supported in the Web client without an installed extension to work with files.'"));
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииПродолжение(Подключено, Отказ) Экспорт
	Возврат;	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	ТаблицаСоответствия = Настройки.Получить("СопоставлениеРеквизитов");
	Если ТаблицаСоответствия<>Неопределено Тогда
		ЕстьНесоответствие = Ложь;
		Для каждого Строка Из ТаблицаСоответствия Цикл
			Строки = СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("ПредставлениеКолонкиФайла", Строка.ПредставлениеКолонкиФайла));
			Если Строки.Количество() = 0 Тогда
				ЕстьНесоответствие = Истина;
			Иначе
				Если ЗначениеЗаполнено(Строка.ИмяРеквизита) Тогда
					ЗаполняемаяСтрока = Строки[0];
					ЗаполнитьЗначенияСвойств(ЗаполняемаяСтрока, Строка,, "ИмяКолонкиФайла");
					Если ЗаполняемаяСтрока.ИмяРеквизита = "Наименование" Тогда
						ЗаполняемаяСтрока.Поиск = ИскатьПоНаименованию;
					ИначеЕсли ЗаполняемаяСтрока.ТипРеквизита = ТипКИEMail Тогда
						ЗаполняемаяСтрока.Поиск = ИскатьПоEmail;
					ИначеЕсли ЗаполняемаяСтрока.ТипРеквизита = ТипКИТелефон Тогда
						ЗаполняемаяСтрока.Поиск = ИскатьПоТелефону;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьНесоответствие Тогда
			// ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Загружаемые настройки не соответствуют выбранному
			// файлу по составу колонок! |Загружены настройки сопоставления только для соответствующих колонок.'"));
		КонецЕсли;
		Настройки.Удалить("СопоставлениеРеквизитов");
		ВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Сопоставлен", Истина)).Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не сопоставлены поля справочников с колонками файла!';en='Catalogs fields are not matching to file columns!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ДеревоРеквизитов = Обработки.CRM_ЗагрузкаДанныхИзФайла.СформироватьДеревоРеквизитов("CRM_ПотенциальныеКлиенты");
	СтрокиОбязательных = ДеревоРеквизитов.Строки.НайтиСтроки(Новый Структура("Обязательный", Истина), Истина);
	Для каждого Строка Из СтрокиОбязательных Цикл
		Если СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Сопоставлен, Объект", Истина, Строка.Объект)).Количество() > 0 Тогда
			Если СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Сопоставлен, Объект, ИмяРеквизита", Истина, Строка.Объект, Строка.ИмяРеквизита)).Количество() = 0 Тогда
				Если РеквизитыЗаполняемыеПоУмолчанию.НайтиПоЗначению(Строка.Объект+"."+Строка.ИмяРеквизита) = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Не сопоставлено обязательное для заполнения поле ""%1""!';en='Required field ""%1"" is not compared!'"),
						Строка.ПредставлениеРеквизита));
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	ПроверяемыеРеквизиты.Добавить("Ответственный");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Если СопоставлениеРеквизитов.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ИмяФайлаОбменаНачалоВыбораЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Все сделанные ранее сопоставления будут утеряны. Продолжить?';en='All ma before comparison will be lost. Continue?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыборФайла();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбораЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СопоставлениеРеквизитов.Очистить();
		ВыборФайла();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если СтрокВЗагружаемомФайле > 50 Тогда
			CRM_ОбщегоНазначенияКлиент.ПоказатьНашеПредупреждение(НСтр("ru='Можно продолжать использовать систему, по окончании загрузки появится оповещение."
"Время операции может быть длительным из-за размера файла.';en='You can continue to use system, when download is complete, a notification will appear."
"Operation time may be long due to file size.'"), 5, НСтр("ru='Импорт клиентов из файла начался'"));
		КонецЕсли;
		
		ДлительнаяОперация = ЗагрузитьНаСервере();
		Если ДлительнаяОперация = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ДлительнаяОперация.Статус = "Выполнено" Тогда
			CRM_ОбщегоНазначенияКлиент.ВывестиСообщениеПоОкончанииФоновогоЗадания(ДлительнаяОперация, Неопределено);
		ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ВывестиСообщениеПоОкончанииФоновогоЗадания", CRM_ОбщегоНазначенияКлиент);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;
		// CRM_НастройкаРазделовРешения 
		Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			ЗаписьВыполнена = CRM_НачалоРаботыСПрограммойСервер.ЗаписатьНастроенныйРазделРешения(ПредопределенноеЗначение("Перечисление.CRM_РазделыНастройкиРешения.ПортретКлиента"));
			Если ЗаписьВыполнена Тогда
				Оповестить("ОбновитьНастроенныеРазделы");
			КонецЕсли;
		КонецЕсли;
		Если ДлительнаяОперация.Статус = "Выполняется" И СтрокВЗагружаемомФайле > 50 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект);
			CRM_ОбщегоНазначенияКлиент.ПоказатьНашеПредупреждение(НСтр("ru='Можно продолжать использовать систему, по окончании загрузки появится оповещение."
"Время операции может быть длительным из-за размера файла.'"), 5,
																	НСтр("ru='Импорт клиентов из файла начался'"),
																	ОписаниеОповещения);
		Иначе
			ЗагрузитьЗавершение();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат = Неопределено, ДопПараметры = Неопределено) Экспорт
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФайлаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Файл = Новый Файл(ИмяФайла);
		РасширениеФайла = СтрЗаменить(Файл.Расширение, ".", "");
		Если СтрНайти(РасширениеФайла, "xls") = 0 И СтрНайти(РасширениеФайла, "ods") = 0 Тогда
			Элементы.Разделитель.Видимость = Истина;
		Иначе	
			Элементы.Разделитель.Видимость = Ложь;
		КонецЕсли;
		ПрочитатьФайлВТаблицу();
	Иначе	
		РасширениеФайла = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазделительПриИзменении(Элемент)
	Если Разделитель<>"" Тогда
		СопоставлениеРеквизитов.Очистить();
		ПрочитатьФайлВТаблицу();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовПредставлениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытия = Новый Структура("ИмяМакета", "CRM_ПотенциальныеКлиенты");
	МассивРеквизитов = Новый Массив;
	Для каждого Строка Из СопоставлениеРеквизитов Цикл
		Если Строка(Строка.ТипРеквизита) <> "Строка" Тогда
			МассивРеквизитов.Добавить(Строка.ПредставлениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	ПараметрыОткрытия.Вставить("ИсключитьРеквизиты", МассивРеквизитов);
	ОткрытьФорму("Обработка.CRM_ЗагрузкаДанныхИзФайла.Форма.ФормаВыбораРеквизита", ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовПредставлениеРеквизитаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекДанные, ВыбранноеЗначение);
	ТекДанные.Сопоставлен = Истина;
	Если ТекДанные.ИмяРеквизита = "CRM_ИНН" ИЛИ ТекДанные.ИмяРеквизита = "CRM_КПП" Тогда
		ТекДанные.Поиск = Истина;
	ИначеЕсли ТекДанные.ИмяРеквизита = "Наименование" Тогда
		ТекДанные.Поиск = ИскатьПоНаименованию;
	ИначеЕсли ТекДанные.ТипРеквизита = ТипКИEMail Тогда
		ТекДанные.Поиск = ИскатьПоEmail;
	ИначеЕсли ТекДанные.ТипРеквизита = ТипКИТелефон Тогда
		ТекДанные.Поиск = ИскатьПоТелефону;
	ИначеЕсли ТекДанные.ИмяРеквизита = "Тема" Тогда
		ТекДанные.Поиск = Истина;
	КонецЕсли;
		
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовПредставлениеРеквизитаОчистка(Элемент, СтандартнаяОбработка)
	ТекДанные = Элементы.СопоставлениеРеквизитов.ТекущиеДанные;
	ТекДанные.ИмяРеквизита = "";
	ТекДанные.ТипРеквизита = Неопределено;
	ТекДанные.Объект = Неопределено;
	ТекДанные.Сопоставлен = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеРеквизитовПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СкачатьПримерФайлаНажатие(Элемент)
	АдресФайлаПримера = ПолучитьАдресФайлаВХранилище();
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла;
	ПолучаемыйФайл.Имя = НСтр("ru='Пример файла импорта потенциальных клиентов'")+".csv";
	ПолучаемыйФайл.Хранение = АдресФайлаПримера;
	ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	ОписаниеОповещения = Новый ОписаниеОповещения("СкачатьПримерФайлаЗавершение", ЭтотОбъект);
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогСохраненияФайла.ПолноеИмяФайла = ПолучаемыйФайл.Имя;
	ДиалогСохраненияФайла.Фильтр = НСтр("ru='Текстовый документ c разделителями (*.csv)|*.csv'");
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ДиалогСохраненияФайла);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьПоТелефонуПриИзменении(Элемент)
	ПоляПоискаПриИзменении(ТипКИТелефон, ИскатьПоТелефону);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьПоEmailПриИзменении(Элемент)
	ПоляПоискаПриИзменении(ТипКИEMail, ИскатьПоEmail);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНужнаПомощьНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(CRM_ОбщегоНазначенияСервер.ПолучитьСсылкуНаРазделСправки("ЗагрузкаДанныхИзФайла"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПодвалаФормы

&НаКлиенте
Процедура СценарийПродажНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоПоддержка", Ложь);
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	СтруктураОтбора.Вставить("Родитель", ПредопределенноеЗначение("Справочник.CRM_СостоянияИнтересов.ПустаяСсылка"));
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Справочник.CRM_СостоянияИнтересов.Форма.ФормаВыбора", ПараметрыФормыВыбора, Элемент, УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьЭлементов()
	Элементы.СценарийПродаж.Видимость = (СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("Объект, ИмяРеквизита", "Документ.CRM_Интерес", "Тема")).Количество() > 0);
	Элементы.ТипУслуги.Видимость = Элементы.СценарийПродаж.Видимость;
	Элементы.ИскатьПоТелефону.Видимость = (СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("ТипРеквизита", ТипКИТелефон)).Количество() > 0); 
	Элементы.ИскатьПоEmail.Видимость = (СопоставлениеРеквизитов.НайтиСтроки(Новый Структура("ТипРеквизита", ТипКИEMail)).Количество() > 0);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресФайла);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	
	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("Расширение", РасширениеФайла);
	ПараметрыВызоваСервера.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	ПараметрыВызоваСервера.Вставить("Разделитель", Разделитель);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = НСтр("ru='Загрузка справочников из файла: Выполнение серверного метода загрузка данных из файла'");
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьВФоне("Обработки.CRM_ЗагрузкаДанныхИзФайла.ЗагрузитьФайлВТаблицу",
		ПараметрыВызоваСервера, ПараметрыВыполненияВФоне);
	
	Возврат ФоновоеЗадание;
	
КонецФункции

&НаКлиенте
Процедура ПрогрессВыполнения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполняется" Тогда
		Прогресс = ПрочитатьПрогресс(Результат.ИдентификаторЗадания);
		Если Прогресс <> Неопределено Тогда
			ФоновоеЗаданиеПроцент = Прогресс.Процент;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПрогресс(ИдентификаторЗадания)
	Возврат ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторЗадания);
КонецФункции


&НаКлиенте
Процедура ПослеЗагрузкиФайлаСДаннымиВТаблицуЗначений(ФоновоеЗадание, ДополнительныеПараметры) Экспорт

	Если ФоновоеЗадание.Статус = "Выполнено" Тогда
		АдресТаблицыСДанными = ФоновоеЗадание.АдресРезультата;
		ПослеЗагрузкиФайлаСДаннымиВТаблицуЗначенийСервер(АдресТаблицыСДанными);
		ВидимостьЭлементов();
	Иначе
		ВывестиСообщениеОбОшибке(НСтр("ru='Не удалось произвести загрузку данных.'"), ФоновоеЗадание.КраткоеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиФайлаСДаннымиВТаблицуЗначенийСервер(АдресТаблицыСДанными)

	ТаблицаДанных = ПолучитьИзВременногоХранилища(АдресТаблицыСДанными);
	СтрокВЗагружаемомФайле = ТаблицаДанных.Количество();
	Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
		НоваяСтрока = СопоставлениеРеквизитов.Добавить();
		НоваяСтрока.ИмяКолонкиФайла = Колонка.Имя;
		НоваяСтрока.ПредставлениеКолонкиФайла = Колонка.Заголовок;
	КонецЦикла;
	Если СопоставлениеРеквизитов.Количество() > 0 Тогда
		ДеревоРеквизитов = Обработки.CRM_ЗагрузкаДанныхИзФайла.СформироватьДеревоРеквизитов("CRM_ПотенциальныеКлиенты");
		Для каждого Строка Из СопоставлениеРеквизитов Цикл
			СтрокаДерева = ДеревоРеквизитов.Строки.Найти(Строка.ПредставлениеКолонкиФайла, "ПредставлениеРеквизита", Истина);
			Если СтрокаДерева <> Неопределено Тогда
				Строка.Объект = СтрокаДерева.Объект;
				Строка.ИмяРеквизита = СтрокаДерева.ИмяРеквизита;
				Строка.ПредставлениеРеквизита = СтрокаДерева.ПредставлениеРеквизита;
				Строка.ТипРеквизита = СтрокаДерева.ТипРеквизита;
				Строка.Обязательный = СтрокаДерева.Обязательный;
				Строка.Сопоставлен = Истина;
				Если Строка.ТипРеквизита = ТипКИEMail Тогда
					Строка.Поиск = ИскатьПоEmail;
				ИначеЕсли Строка.ТипРеквизита = ТипКИТелефон Тогда
					Строка.Поиск = ИскатьПоТелефону;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиСообщениеОбОшибке(ТекстОшибкиДляПользователя, ТехническаяИнформация)
	ТекстСообщенияОбОшибке = ТекстОшибкиДляПользователя + Символы.ПС
		+ НСтр("ru='Возможная причина: Загружаемые данные некорректные."
"Техническая информация: %1'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщенияОбОшибке, ТехническаяИнформация));
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайлВТаблицу()
	
	ФоновоеЗадание = ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере();
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
	Обработчик = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаСДаннымиВТаблицуЗначений", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаПродолжение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПроверитьРасширениеРаботыСФайламиПодключено(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаПродолжение(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);

	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru='Все поддерживаемые форматы файлов(*.xls;*.xlsx;*.ods;*.mxl;*.csv;*.txt)|*.xls;*.xlsx;*.ods;*.mxl;*.csv;*.txt|Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx|Электронная таблица OpenDocument (*.ods)|*.ods|Текстовый документ c разделителями (*.csv;*.txt)|*.csv;*.txt|Табличный документ (*.mxl)|*.mxl'");
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОповещениеЗавершения , ПараметрыЗагрузки, ИмяФайла);
КонецПроцедуры
	
&НаКлиенте
Процедура ВыборФайлаЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ИмяФайла = Результат.Имя;
		АдресФайла = Результат.Хранение;
		ИмяФайлаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере()
	ИмяМетода = "Обработки.CRM_ЗагрузкаДанныхИзФайла.ЗагрузитьПотенциальныхКлиентов";
	
	НастройкиЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	НастройкиЗапуска.НаименованиеФоновогоЗадания = НСтр("ru='Загрузка клиентской базы из файла'");
	НастройкиЗапуска.ОжидатьЗавершение = 0;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("ТаблицаДанных", ПолучитьИзВременногоХранилища(АдресТаблицыСДанными));
	ПараметрыМетода.Вставить("СопоставлениеРеквизитов", РеквизитФормыВЗначение("СопоставлениеРеквизитов", Тип("ТаблицаЗначений")));
	ПараметрыМетода.Вставить("Ответственный", Ответственный);
	ПараметрыМетода.Вставить("ИскатьПоТелефону", ИскатьПоТелефону);
	ПараметрыМетода.Вставить("ИскатьПоEmail", ИскатьПоEmail);
	ПараметрыМетода.Вставить("ИскатьПоНаименованию", ИскатьПоНаименованию);
	ПараметрыМетода.Вставить("Группа", Группа);
	ПараметрыМетода.Вставить("СценарийПродаж", СценарийПродаж);
	ПараметрыМетода.Вставить("ТипУслуги", ТипУслуги);

	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыМетода, НастройкиЗапуска);
КонецФункции

&НаКлиенте
Процедура СкачатьПримерФайлаЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	Результат = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайлаВХранилище()
	ДвоичныеДанные = Обработки.CRM_ЗагрузкаДанныхИзФайла.ПолучитьМакет("CRM_ПотенциальныеКлиентыПример");
	АдресФайлаПримера = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	Возврат АдресФайлаПримера;
КонецФункции

&НаСервере
Процедура ПоляПоискаПриИзменении(ТипКИ, Поиск)
	Для каждого Строка Из СопоставлениеРеквизитов Цикл
		Если Строка.ТипРеквизита = ТипКИ Тогда
			Строка.Поиск = Поиск;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
